lib/tasks/dev.rake

SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? AND "coins"."mining_type_id" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://assets.chinatechnews.com/wp-content/uploads/bitcoin-logo.jpg"], ["mining_type_id", 1], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoS"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "MaM"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando moedas....") do
      coins = [{
        description: "Bitcoin",
        acronym: "BTC",
        url_image: "https://assets.chinatechnews.com/wp-content/uploads/bitcoin-logo.jpg",
        mining_type: MiningType.find_by(acronym: 'PoW')
      },
      {
        description: "Ethereum",
        acronym: "ETH",
        url_image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZCRfwkqpPvFb3QmmwGONG2i6PsgnqZ3L7dRzCNlaSTB1-ruu5",
        mining_type: MiningType.find_by(acronym: 'PoW')
      },
      {
        description: "Dash",
        acronym: "DASH",
        url_image: "https://ih1.redbubble.net/image.406055498.8711/ap,550x550,12x12,1,transparent,t.png",
        mining_type: MiningType.find_by(acronym: 'PoS')
      },
      {
        description: "Iota",
        acronym: "IOT",
        url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1720.png",
        mining_type: MiningType.find_by(acronym: "MaM")
      },
      {
        description: "ZCash",
        acronym: "ZEC",
        url_image: "https://www.cryptocompare.com/media/351360/zec.png",
        mining_type: MiningType.find_by(acronym: 'PoW')
      }]

      coins.each do |coin|
        Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2023-04-01 23:47:49.711653"], ["updated_at", "2023-04-01 23:47:49.711653"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types = [
        {description: "Proof of Work", acronym: "PoW"},
        {description: "Proof of Stake", acronym: "PoS"},
        {description: "Proof of Capacity", acronym: "PoC"},
        {description: "Masked Authenticated Messaging", acronym: "MaM"}
      ]

      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)